mdaldoss/arduino-esp32/libraries/BluetoothSerial/src/BluetoothSerial.cpp
static bool waitForConnect(int linkid, int timeout) {
    TickType_t xTicksToWait = timeout / portTICK_PERIOD_MS;
    // wait for connected or closed
    EventBits_t rc = xEventGroupWaitBits(_spp_event_group_l[linkid], SPP_CONNECTED | SPP_CLOSED, pdFALSE, pdFALSE, xTicksToWait);
    if((rc & SPP_CONNECTED) != 0)
        return true;
    else if((rc & SPP_CLOSED) != 0) {
        log_d("connection closed!");
        return false;
    }
    log_d("timeout");
    return false;
}

static bool waitForDiscovered(int timeout) {
    TickType_t xTicksToWait = timeout / portTICK_PERIOD_MS;
    return (xEventGroupWaitBits(_spp_event_group, BT_DISCOVERY_COMPLETED, pdFALSE, pdTRUE, xTicksToWait) & BT_DISCOVERY_COMPLETED) != 0;
}

static bool waitForSDPRecord(int timeout) {
    TickType_t xTicksToWait = timeout / portTICK_PERIOD_MS;
    return (xEventGroupWaitBits(_bt_event_group, BT_SDP_COMPLETED, pdFALSE, pdTRUE, xTicksToWait) & BT_SDP_COMPLETED) != 0;
}

int bt_getRSSI(char* address){
    // update rssi result
	uint32_t hexAddrTmp[ESP_BD_ADDR_LEN];
	esp_bd_addr_t hexAddr;
	bool retCode = (sscanf(address, "%x:%x:%x:%x:%x:%x", &hexAddrTmp[0], &hexAddrTmp[1], &hexAddrTmp[2], &hexAddrTmp[3],&hexAddrTmp[4],&hexAddrTmp[5]) != EOF) ? true : false;

	for (uint8_t i = 0; i < ESP_BD_ADDR_LEN && (retCode == true); i++)
	{
		if (hexAddrTmp[i] <= 0xFF)
		{
			hexAddr[i] = (uint8_t)hexAddrTmp[i];
		}
		else
		{
			retCode = false;
		}
	}
	if (retCode == true)
	{
         if(esp_ble_gap_read_rssi(hexAddr) != ESP_OK){
        log_e("bt_getRSSI | Error in requiring updated RSSI!");
    }
    }
    int cnt = scanResults.getCount();
    int rssi = 0;
    BTAdvertisedDevice* dev;
        for (int i=0; i < cnt; i++) {
			dev = scanResults.getDevice(i);
			if (dev && strcmp(address, dev->getAddress().toString().c_str()))
            {      
                rssi = dev->getRSSI();
                break;
            }
		}
    //esp_bt_gap_read_rssi_delta(_peer_bd_addr);
	return rssi;
}

/*
 * Serial Bluetooth Arduino
 *
 * */

BluetoothSerial::BluetoothSerial()
{
    local_name = "ESP32"; //default bluetooth name
}

BluetoothSerial::~BluetoothSerial(void)
{
    _stop_bt();
}

/**
 * @Param isMaster set to true if you want to connect to an other device
 */
bool BluetoothSerial::begin(String localName, bool isMaster)
{
    memset(remote_nodes,0,sizeof(remote_nodes));
    _isMaster = isMaster;
    if (localName.length()){
        local_name = localName;
    }
    return _init_bt(local_name.c_str());
}

int BluetoothSerial::available(int linkid)
{
    if(linkid>MAX_BT_ACCEPTORS){
        log_e("Error: Link id out of range. Please use a linkid between 0-%d",MAX_BT_ACCEPTORS);
        return -1;
    }
    if (_spp_rx_queue[linkid] == NULL){
         log_e("Rx Queue do not exist. Has the device been correctly init?");
        return 0;
    }
    return uxQueueMessagesWaiting(_spp_rx_queue[linkid]);
}

int BluetoothSerial::peek(int linkid)
{
    if(linkid>MAX_BT_ACCEPTORS){
        log_e("Error: Link id out of range. Please use a linkid between 0-%d",MAX_BT_ACCEPTORS);
        return -1;
    }
    uint8_t c;
    if (_spp_rx_queue[linkid] && xQueuePeek(_spp_rx_queue[linkid], &c, this->timeoutTicks)){
        return c;
    }
    return -1;
}

bool BluetoothSerial::hasClient(int linkid)
{
    return remote_nodes[linkid].handle > 0;
}

int BluetoothSerial::getRSSI(int linkid){
    if(linkid>MAX_BT_ACCEPTORS){
        log_e("Error: Link id out of range. Please use a linkid between 0-%d",MAX_BT_ACCEPTORS);
        return 0;
    }
    char address[18];
    sprintf(address, "%02x:%02x:%02x:%02x:%02x:%02x", remote_nodes[linkid]._peer_bd_addr[0],remote_nodes[linkid]._peer_bd_addr[1],remote_nodes[linkid]._peer_bd_addr[2],remote_nodes[linkid]._peer_bd_addr[3],remote_nodes[linkid]._peer_bd_addr[4],remote_nodes[linkid]._peer_bd_addr[5]);
    return bt_getRSSI(address);
}

int BluetoothSerial::getRSSI(char* address){    
    return bt_getRSSI(address);
}

int BluetoothSerial::getRSSI(esp_bd_addr_t _peer_bd_addr){    
    char address[18];
    sprintf(address, "%02x:%02x:%02x:%02x:%02x:%02x", _peer_bd_addr[0],_peer_bd_addr[1],_peer_bd_addr[2],_peer_bd_addr[3],_peer_bd_addr[4],_peer_bd_addr[5]);
    return bt_getRSSI(address);
}

int BluetoothSerial::read(int linkid)
{
    if(linkid>MAX_BT_ACCEPTORS){
        log_e("Error: Link id out of range. Please use a linkid between 0-%d",MAX_BT_ACCEPTORS);
        return -1;
    }
    uint8_t c = 0;
    if (_spp_rx_queue[linkid] && xQueueReceive(_spp_rx_queue[linkid], &c, this->timeoutTicks)){
        return c;
    }
    return -1;
}

/**
 * Set timeout for read / peek
 */
void BluetoothSerial::setTimeout(int timeoutMS)
{
    this->timeoutTicks=timeoutMS / portTICK_PERIOD_MS;
}

size_t BluetoothSerial::write(uint8_t c, int linkid)
{  
    if(linkid>MAX_BT_ACCEPTORS){
        log_e("Error: Link id out of range. Please use a linkid between 0-%d",MAX_BT_ACCEPTORS);
        return 0;
    }
    return write(&c, 1, linkid);
}

size_t BluetoothSerial::write(const uint8_t *buffer, size_t size, int linkid)
{
    if(linkid>MAX_BT_ACCEPTORS){
        log_e("Error: Link id out of range. Please use a linkid between 0-%d",MAX_BT_ACCEPTORS);
        return 0;
    }
    if (!remote_nodes[linkid].handle){
        return 0;
    }
    log_i("write %d bytes to handle: %d", size, remote_nodes[linkid].handle);
    return (_spp_queue_packet(remote_nodes[linkid].handle,(uint8_t *)buffer, size) == ESP_OK) ? size : 0;
}

void BluetoothSerial::flush()
{
    if (_spp_tx_queue != NULL){
        while(uxQueueMessagesWaiting(_spp_tx_queue) > 0){
           delay(100);
        }
    }
}

void BluetoothSerial::end()
{
    _stop_bt();
}

void BluetoothSerial::onConfirmRequest(ConfirmRequestCb cb)
{
    confirm_request_callback = cb;
}

void BluetoothSerial::onAuthComplete(AuthCompleteCb cb)
{
    auth_complete_callback = cb;
}

void BluetoothSerial::confirmReply(boolean confirm)
{
    esp_bt_gap_ssp_confirm_reply(current_bd_addr, confirm);  
}


