mdaldoss/arduino-esp32/libraries/BluetoothSerial/src/BluetoothSerial.cpp
esp_err_t BluetoothSerial::register_callback(esp_spp_cb_t * callback)
{
    custom_spp_callback = callback;
    return ESP_OK;
}

//Simple Secure Pairing
void BluetoothSerial::enableSSP() {
    _enableSSP = true;
}
/*
     * Set default parameters for Legacy Pairing
     * Use fixed pin code
*/
bool BluetoothSerial::setPin(const char *pin) {
    log_i("pin: %s", pin);
    bool isEmpty =  !(pin  && *pin);
    if (isEmpty && !_isPinSet) {
        return true; // nothing to do
    } else if (!isEmpty){
        _pin_len = strlen(pin);
        memcpy(_pin_code, pin, _pin_len);
    } else {
        _pin_len = 0; // resetting pin to none (default)
    }
    _pin_code[_pin_len] = 0;
    _isPinSet = true;
    if (isReady(false, READY_TIMEOUT)) {
        btSetPin();
    }
    return true;
}

bool BluetoothSerial::connect(String remoteName, int linkid)
{
    if(linkid>MAX_BT_ACCEPTORS){
        log_e("Error: Link id out of range");
        return false;
    }
    current_client_id = linkid; // setting reference for given linkid
    bool retval = false;

    if (!isReady(true, READY_TIMEOUT)) return false;
    if (remoteName && remoteName.length() < 1) {
        log_e("No remote name is provided");
        return false; 
    }
    disconnect(linkid);
    remote_nodes[linkid]._doConnect = true;
    remote_nodes[linkid]._isRemoteAddressSet = false;
	_sec_mask = ESP_SPP_SEC_ENCRYPT|ESP_SPP_SEC_AUTHENTICATE;
	_role = ESP_SPP_ROLE_MASTER;
    strncpy(remote_nodes[linkid]._remote_name, remoteName.c_str(), ESP_BT_GAP_MAX_BDNAME_LEN);
    remote_nodes[linkid]._remote_name[ESP_BT_GAP_MAX_BDNAME_LEN] = 0;
    log_i("master : remoteName");
    // will first resolve name to address
#ifdef ESP_IDF_VERSION_MAJOR
        esp_bt_gap_set_scan_mode(ESP_BT_CONNECTABLE, ESP_BT_GENERAL_DISCOVERABLE);
#else
        esp_bt_gap_set_scan_mode(ESP_BT_SCAN_MODE_CONNECTABLE_DISCOVERABLE);
#endif
    xEventGroupClearBits(_spp_event_group_l[linkid], SPP_CLOSED);
    if (esp_bt_gap_start_discovery(ESP_BT_INQ_MODE_GENERAL_INQUIRY, INQ_LEN, INQ_NUM_RSPS) == ESP_OK) {
        retval = waitForConnect(linkid, SCAN_TIMEOUT);
    }
    if (retval == false) {
      remote_nodes[linkid]._isRemoteAddressSet = false;
    }
    return retval;
}

/**
 * @Param channel: specify channel or 0 for auto-detect
 * @Param sec_mask:
 *           ESP_SPP_SEC_ENCRYPT|ESP_SPP_SEC_AUTHENTICATE
 *           ESP_SPP_SEC_NONE
 * @Param role:
 *           ESP_SPP_ROLE_MASTER   master can handle up to 7 connections to slaves
 *           ESP_SPP_ROLE_SLAVE    can only have one connection to a master
 */
bool BluetoothSerial::connect(uint8_t remoteAddress[], int linkid, int channel, esp_spp_sec_t sec_mask, esp_spp_role_t role)
{
    if(linkid>MAX_BT_ACCEPTORS){
        log_e("Error: Link id out of range");
        return false;
    }
    current_client_id = linkid; // setting reference for given linkid
    bool retval = false;
    if (!isReady(true, READY_TIMEOUT)) return false;
    if (!remoteAddress) {
        log_e("No remote address is provided");
        return false; 
    }
    //disconnect(linkid);
    remote_nodes[linkid]._doConnect = true;
    remote_nodes[linkid]._remote_name[0] = 0;
    remote_nodes[linkid]._isRemoteAddressSet = true;

	_sec_mask = sec_mask;
	_role = role;
    memcpy(remote_nodes[linkid]._peer_bd_addr, remoteAddress, ESP_BD_ADDR_LEN);
    log_i("master : remoteAddress %d", remote_nodes[linkid]._peer_bd_addr[0]);
    xEventGroupClearBits(_spp_event_group_l[linkid], SPP_CLOSED);
    if (channel > 0) {
#if (ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO)
        char bda_str[18];
        log_i("spp connect to remote %s channel %d",
            bda2str(remote_nodes[linkid]._peer_bd_addr, bda_str, sizeof(bda_str)),
            channel);
#endif
        if(esp_spp_connect(sec_mask, role, channel, remote_nodes[linkid]._peer_bd_addr) != ESP_OK ) 
        {
			log_e("spp connect failed");
      retval = false;
    } else {
      retval = waitForConnect(linkid, READY_TIMEOUT);
      if(retval) {
            log_i("connected");
        } else {
            if(this->isClosed()) {
                log_e("connect failed");
            } else {
                log_e("connect timed out after %dms", READY_TIMEOUT);
            }
        }
    }
  } else if (esp_spp_start_discovery(remote_nodes[linkid]._peer_bd_addr) == ESP_OK) {
    retval = waitForConnect(linkid, READY_TIMEOUT);
  }

  if (!retval) {
    remote_nodes[linkid]._isRemoteAddressSet = false;
    }
    return retval;
}

bool BluetoothSerial::connect(int linkid)
{
    if(linkid>MAX_BT_ACCEPTORS){
        log_e("Error: link id out of range");
        return false;
    }
    current_client_id = linkid; // setting reference for given linkid
    if (!isReady(true, READY_TIMEOUT)) return false;
    remote_nodes[linkid]._doConnect = true;
    if (remote_nodes[linkid]._isRemoteAddressSet){
        //disconnect(linkid);
        // use resolved or set address first
        log_i("master : remoteAddress");
        if (esp_spp_start_discovery(remote_nodes[linkid]._peer_bd_addr) == ESP_OK) {
            return waitForConnect(linkid, READY_TIMEOUT);
        }
        return false;
    } else if (remote_nodes[linkid]._remote_name[0]) {
       // disconnect(linkid);
        log_i("master : remoteName");
        // will resolve name to address first - it may take a while
#ifdef ESP_IDF_VERSION_MAJOR
        esp_bt_gap_set_scan_mode(ESP_BT_CONNECTABLE, ESP_BT_GENERAL_DISCOVERABLE);
#else
        esp_bt_gap_set_scan_mode(ESP_BT_SCAN_MODE_CONNECTABLE_DISCOVERABLE);
#endif
        if (esp_bt_gap_start_discovery(ESP_BT_INQ_MODE_GENERAL_INQUIRY, INQ_LEN, INQ_NUM_RSPS) == ESP_OK) {
            return waitForConnect(linkid, SCAN_TIMEOUT);
        }
        return false;
    }
    log_e("Neither Remote name nor address was provided");
    return false;
}

bool BluetoothSerial::disconnect(int linkid) {
    if(linkid>MAX_BT_ACCEPTORS){
        log_e("Error: Link id out of range");
        return false;
    }
    if (remote_nodes[linkid].handle) {
        flush();
        log_i("disconnecting");
        if (esp_spp_disconnect(remote_nodes[linkid].handle) == ESP_OK) {
            TickType_t xTicksToWait = READY_TIMEOUT / portTICK_PERIOD_MS;
            return (xEventGroupWaitBits(_spp_event_group_l[linkid], SPP_DISCONNECTED, pdFALSE, pdTRUE, xTicksToWait) & SPP_DISCONNECTED) != 0;
        }
    }
    return false;
}

bool BluetoothSerial::unpairDevice(uint8_t remoteAddress[]) {
    if (isReady(false, READY_TIMEOUT)) {
        log_i("removing bonded device");
        return (esp_bt_gap_remove_bond_device(remoteAddress) == ESP_OK);
    }
    return false;
}

bool BluetoothSerial::connected(int linkid, int timeout) {
    return waitForConnect(linkid, timeout);
}

/**
 * true if a connection terminated or a connection attempt failed
 */
bool BluetoothSerial::isClosed(int linkid){
    if(linkid>MAX_BT_ACCEPTORS){
        log_e("Error: Link id out of range");
        return false;
    }
    return xEventGroupGetBits(_spp_event_group_l[linkid]) & SPP_CLOSED;
}

bool BluetoothSerial::isReady(bool checkMaster, int timeout) {
    if (checkMaster && !_isMaster) {
        log_e("Master mode is not active. Call begin(localName, true) to enable Master mode");
        return false;
    }
    if (!btStarted()) {
        log_e("BT is not initialized. Call begin() first");
        return false;
    }
    TickType_t xTicksToWait = timeout / portTICK_PERIOD_MS;
    return (xEventGroupWaitBits(_spp_event_group, SPP_RUNNING, pdFALSE, pdTRUE, xTicksToWait) & SPP_RUNNING) != 0;
}


/**
 * @brief           RemoteName or address are not allowed to be set during discovery
 *                  (otherwhise it might connect automatically and stop discovery)
 * @param[in]       timeoutMs can range from MIN_INQ_TIME to MAX_INQ_TIME
 * @return          in case of Error immediately Empty ScanResults.
 */
BTScanResults* BluetoothSerial::discover(int timeoutMs) {
    scanResults.clear();
    if (timeoutMs < MIN_INQ_TIME || timeoutMs > MAX_INQ_TIME || strlen(remote_nodes[current_client_id]._remote_name) || remote_nodes[current_client_id]._isRemoteAddressSet)
            return nullptr;
    int timeout = timeoutMs / INQ_TIME;
    log_i("discover::disconnect");
    for (int i = 0; i < MAX_BT_ACCEPTORS; i++)
    {
        disconnect(i);
    }
    log_i("discovering");
    // will resolve name to address first - it may take a while
    esp_bt_gap_set_scan_mode(ESP_BT_CONNECTABLE, ESP_BT_GENERAL_DISCOVERABLE);
    if (esp_bt_gap_start_discovery(ESP_BT_INQ_MODE_GENERAL_INQUIRY, timeout, 0) == ESP_OK) {
        waitForDiscovered(timeoutMs);
        log_i("gap_cancel_discovery()");
        esp_bt_gap_cancel_discovery();
    }
    return &scanResults;
}

/**
 * @brief           RemoteName or address are not allowed to be set during discovery
 *                  (otherwhise it might connect automatically and stop discovery)
 * @param[in]       cb called when a [b]new[/b] device has been discovered
 * @param[in]       timeoutMs can be 0 or range from MIN_INQ_TIME to MAX_INQ_TIME
 *
 * @return          Wheter start was successfull or problems with params
 */
bool BluetoothSerial::discoverAsync(BTAdvertisedDeviceCb cb, int timeoutMs) {
    scanResults.clear();
    if (strlen(remote_nodes[current_client_id]._remote_name) || remote_nodes[current_client_id]._isRemoteAddressSet)
        return false;
    int timeout = timeoutMs / INQ_TIME;
    for (int i = 0; i < MAX_BT_ACCEPTORS; i++)
    {
        disconnect(i);
    }
    advertisedDeviceCb = cb;
    log_i("discovering");
    // will resolve name to address first - it may take a while
    esp_bt_gap_set_scan_mode(ESP_BT_CONNECTABLE, ESP_BT_GENERAL_DISCOVERABLE);
    if (timeout > 0)
        return esp_bt_gap_start_discovery(ESP_BT_INQ_MODE_GENERAL_INQUIRY, timeout, 0) == ESP_OK;
    else return esp_bt_gap_start_discovery(ESP_BT_INQ_MODE_GENERAL_INQUIRY, ESP_BT_GAP_MAX_INQ_LEN, 0) == ESP_OK;
}

